Repository: karlsbjorn/PCXCogs
Catalog: autoroom/locales/*.po
Languages: hr_hr

source: Automatic voice channel management. This cog facilitates automatic voice channel creation. When a member joins an AutoRoom Source (voice channel), this cog will move them to a brand new AutoRoom that they have control over. Once everyone leaves the AutoRoom, it is automatically deleted. For a quick rundown on how to get started with this cog, check out [the readme](https://github.com/PhasecoreX/PCXCogs/tree/master/autoroom/README.md)
hr_hr: Automatsko upravljanje glasovnim kanalima. Ovaj modul pomaže u automatskom stvaranju glasovnih kanala. Kada se član pridruži AutoRoom izvoru (glasovni kanal), ovaj modul će ih premjestiti u potpuno novi AutoRoom nad kojom imaju kontrolu. Nakon što svi napuste AutoRoom, on se automatski briše. For a quick rundown on how to get started with this cog, check out [the readme](https://github.com/PhasecoreX/PCXCogs/tree/master/autoroom/README.md)

source: Set up the cog.
hr_hr: Postavi modul.

source: Show version in help.
hr_hr: Prikaži verziju u pomoći.

source: {pre_processed} Cog Version: {version}
hr_hr: {pre_processed} Verzija modula: {version}

source: Nothing to delete.
hr_hr: Nema išta za brisanje.

source: Remove non-existent AutoRooms from the config.
hr_hr: Ukloni nepostojeće AutoRoome iz konfiguracije.

source: AutoRoom: Associated voice channel deleted.
hr_hr: AutoRoom: Pridruženi glasovni kanal izbrisan.

source: Clean up config when an AutoRoom (or Source) is deleted (either by the bot or the user).
hr_hr: Očisti konfiguraciju kada je AutoRoom (ili izvor) izbrisan (od strane bota ili korisnika)

source: Create a voice channel for a member in an AutoRoom Source channel.
hr_hr: Izradite glasovni kanal za člana u AutoRoom izvornom kanalu.

source: Hello there! It looks like you're trying to make an AutoRoom. Please note that you are only allowed to make **{rate}** AutoRooms every **{time}**. You can try again in **{remaining_time}**.
hr_hr: Hej! Čini se da pokušavaš napraviti novi AutoRoom. Imaj na umu da ti je dopušteno napraviti **{rate}** AutoRooma svakih **{time}**. Možeš pokušati ponovno za **{remaining_time}**.

source: AutoRoom: New AutoRoom needed.
hr_hr: AutoRoom: Potreban novi AutoRoom.

source: AutoRoom: Move user to new AutoRoom.
hr_hr: AutoRoom: Premjesti korisnika u novi AutoRoom.

source: AutoRoom: New text channel needed.
hr_hr: AutoRoom: Potreban je novi tekstualni kanal.

source: Delete AutoRoom if empty.
hr_hr: Izbriši AutoRoom ako je prazan.

source: AutoRoom: Channel empty.
hr_hr: AutoRoom: Kanal prazan.

source: Allow or deny a user access to the text channel associated to an AutoRoom.
hr_hr: Dopusti ili zabrani korisniku pristup tekstualnom kanalu povezanim s AutoRoomom.

source: AutoRoom: Permission change
hr_hr: AutoRoom: Promjena dozvole

source: Check if a member (or role) is an admin (role). Also takes into account if the setting is enabled.
hr_hr: Provjeri je li član (ili uloga) administrator (uloga). Također uzima u obzir je li postavka omogućena.

source: Check if a member (or role) is a mod (role). Also takes into account if the setting is enabled.
hr_hr: Provjeri je li član (ili uloga) moderator (uloga). Također uzima u obzir je li postavka omogućena.

source: Check if the permissions in an AutoRoom Source and a destination category are sufficient.
hr_hr: Provjeri jesi li dozvole u AutoRoom izvornom kanalu i odredišnoj kategoriji dovoljne.

source: Required on Source Voice Channel
hr_hr: Obavezno u izvornom glasovnom kanalu

source: Required on Destination Category
hr_hr: Obavezno u odredišnoj kategoriji

source: Required in Guild
hr_hr: Obavezno u guildu

source: Optional on Destination Category (for text channel)
hr_hr: Izborno u odredišnoj kategoriji (za tekstualni kanal)

source: {status_emoji} Source VC: {autoroom_source} -> Dest Category: {category_dest} {permissions}
hr_hr: {status_emoji} Izvorni glasovni kanal: {autoroom_source} -> Odredišna kategorija: {category_dest} {permissions}

source: Optional on Destination Category (for source clone)
hr_hr: Izborno u odredišnoj kategoriji (za izvorni klon)

source: The autoroom command.
hr_hr: Autoroom naredba.

source: Manage your AutoRoom. For a quick rundown on how to manage your AutoRoom, check out [the readme](https://github.com/PhasecoreX/PCXCogs/tree/master/autoroom/README.md)
hr_hr: Upravljaj svojim AutoRoomom. Za brzi pregled kako upravljati AutoRoomom, pogledajte [readme](https://github.com/PhasecoreX/PCXCogs/tree/master/autoroom/README.md)

source: Display current settings.
hr_hr: Prikaži trenutne postavke.

source: Room Settings
hr_hr: Postavke sobe

source: Owner
hr_hr: Vlasnik

source: Mode
hr_hr: Način rada

source: Server Managed
hr_hr: Upravlja se serverom

source: custom
hr_hr: prilagođeno

source: , only certain roles
hr_hr: , samo određene uloge

source: Access
hr_hr: Pristup

source: Member Roles
hr_hr: Uloge članova

source: Bitrate
hr_hr: Brzina prijenosa

source: Channel Age
hr_hr: Dob kanala

source: Current Access Settings
hr_hr: Trenutne postavke pristupa

source: Allowed Members
hr_hr: Dozvoljeni članovi

source: Allowed Roles
hr_hr: Dozvoljene uloge

source: Denied Members
hr_hr: Odbijeni članovi

source: Denied Roles
hr_hr: Odbijene uloge

source: Change the name of your AutoRoom.
hr_hr: Promijeni naziv svojeg AutoRooma.

source: {message_author}, you can only modify an AutoRoom name **{rate}** times every **{time}** with this command. You can try again in **{remaining_time}**. Alternatively, you can modify the channel yourself by either right clicking the channel on desktop or by long pressing it on mobile.
hr_hr: {message_author}, ovom naredbom možete mijenjati naziv AutoRooma **{rate}** puta svakih **{time}**. Možes pokušati ponovno za **{remaining_time}**. Alternativno, možete sami prilagoditi kanal desnim klikom na kanal na računalu ili dugim pritiskom na mobilnom uređaju.

source: Do note that since this server has 2FA enabled, you will need it enabled on your account to modify the channel in this way.
hr_hr: Imajte na umu da, budući da ovaj server ima 2FA omogućen, morat ćete ga omogućiti na svom računu da biste modificirali kanal.

source: Change the bitrate of your AutoRoom.
hr_hr: Promijeni brzinu prijenosa svojeg AutoRooma.

source: Change the user limit of your AutoRoom.
hr_hr: Promijeni korisničko ograničenje svojeg AutoRooma.

source: Make your AutoRoom public.
hr_hr: Učini svoj AutoRoom javnim.

source: Lock your AutoRoom (visible, but no one can join).
hr_hr: Zaključaj svoj AutoRoom (vidljiv, ali se nitko ne može pridružiti).

source: Make your AutoRoom private.
hr_hr: Učini svoj AutoRoom privatnim.

source: Allow a user (or role) into your AutoRoom.
hr_hr: Dopusti korisniku (ili ulogu) u svoj AutoRoom.

source: Deny a user (or role) from accessing your AutoRoom. If the user is already in your AutoRoom, they will be disconnected. If a user is no longer able to access the room due to denying a role, they too will be disconnected. Keep in mind that if the server is using member roles, denying roles will probably not work as expected.
hr_hr: Zabranite korisniku (ili ulozi) pristup vašem AutoRoomu. Ako je korisnik već u vašem AutoRoomu, bit će izbačen. Ako korisnik više ne može pristupiti kanalu zbog odbijanja uloge, i oni će biti izbačeni. Imajte na umu da ako server koristi uloge članova, odbijanje uloga vjerojatno neće raditi kako treba.

source: AutoRoom: Deny user
hr_hr: AutoRoom: Zabrani korisnika

source: {message_author}, I do not have the required permissions to do this. Please let the staff know about this!
hr_hr: {message_author}, nemam potrebne dozvole za to. Molim obavijestite osoblje o tome!

source: {message_author}, it seems like the AutoRoom Source this AutoRoom was made from no longer exists. Because of that, I can no longer modify this AutoRoom.
hr_hr: {message_author}, čini se da AutoRoom izvor iz kojeg je ovaj AutoRoom napravljen više ne postoji. Zbog toga više ne mogu mijenjati ovaj AutoRoom.

source: user
hr_hr: korisnik

source: them
hr_hr: im

source: role
hr_hr: uloga

source: it
hr_hr: joj

source: since that {user_role} is not allowed to connect to the AutoRoom Source that this AutoRoom was made from, I can't allow {them_it} here either.
hr_hr: budući da {user_role} nema pristup AutoRoom izvoru od kojeg je ovaj AutoRoom napravljen, ne mogu {them_it} ni ovdje dati pristup.

source: this AutoRoom is using member roles, so I can't allow a lower hierarchy role.
hr_hr: ovaj AutoRoom koristi uloge članova, tako da ne mogu dopustiti ulogu niže hijerarhije.

source: why would I deny myself from entering your AutoRoom?
hr_hr: zašto bih sebi uskratio ulazak u tvoj AutoRoom?

source: don't be so hard on yourself! This is your AutoRoom!
hr_hr: nemoj biti tako strog prema sebi! Ovo je tvoj AutoRoom!

source: I don't know if you know this, but that's the server owner... I can't deny them from entering your AutoRoom.
hr_hr: Ne znam znaš li ovo, ali to je vlasnik servera... Ne mogu im zabraniti da uđu u tvoj AutoRoom.

source: that's an admin{role_suffix}, so I can't deny them from entering your AutoRoom.
hr_hr: to je admin{role_suffix}, tako da im ne mogu zabraniti da uđu u tvoj AutoRoom.

source: that's a moderator{role_suffix}, so I can't deny them from entering your AutoRoom.
hr_hr: to je moderator{role_suffix}, tako da im ne mogu zabraniti da uđu u tvoj AutoRoom.

source: {message_author}, you are not in an AutoRoom.
hr_hr: {message_author}, niste u AutoRoomu.

source: (it is a server AutoRoom)
hr_hr: (to je serverski AutoRoom)

source: {message_author}, you are not the owner of this AutoRoom{reason_server}.
hr_hr: {message_author}, nisi vlasnik ovog AutoRooma{reason_server}.

source: The autoroomset command.
hr_hr: autoroomset naredba.

source: Configure the AutoRoom cog. For a quick rundown on how to get started with this cog, check out [the readme](https://github.com/PhasecoreX/PCXCogs/tree/master/autoroom/README.md)
hr_hr: Konfiguriraj AutoRoom modul. Za brzi pregled kako započeti s ovim modulom, pogledajte [readme](https://github.com/PhasecoreX/PCXCogs/tree/master/autoroom/README.md)

source: Server Settings
hr_hr: Postavke servera

source: Admin access all AutoRooms
hr_hr: Administratori imaju pristup svim AutoRoomima

source: Admin access all AutoRoom Text Channels
hr_hr: Administratori imaju pristup svim AutoRoom tekstualnim kanalima

source: Moderator access all AutoRooms
hr_hr: Moderatori imaju pristup svim AutoRoomima

source: Moderator access all AutoRoom Text Channels
hr_hr: Moderatori imaju pristup svim AutoRoom tekstualnim kanalima

source: Room type
hr_hr: Vrsta sobe

source: Destination category
hr_hr: Odredišna kategorija

source: Text Channel
hr_hr: Tekstualni kanal

source: True
hr_hr: Istinito

source: Member Role
hr_hr: Član uloge

source: Username
hr_hr: Korisničko ime

source: Custom: "{channel_name_format}"
hr_hr: Prilagođeno: "{channel_name_format}"

source: Room name format
hr_hr: Format naziva sobe

source: It looks like I am missing one or more required permissions. Until I have them, the AutoRoom cog may not function properly for all AutoRoom Sources. Check `[p]autoroomset permissions` for more information.
hr_hr: Čini se da mi nedostaje jedna ili više potrebnih dozvola. Dok ih ne dobijem, AutoRoom modul možda neće ispravno funkcionirati za sve AutoRoom izvore. Provjerite `[p]autoroomset permissions` za više informacija.

source: It looks like I am missing one or more optional permissions. All AutoRooms will work, however some features (text channels and cloned source permissions) may not work. Check `[p]autoroomset permissions` for more information.
hr_hr: Čini se da mi nedostaje jedna ili više neobaveznih dozvola. Svi AutoRoomi će raditi, no neke značajke (teksutalni kanali i klonirane dozvole izvora) možda neće raditi. Provjerite `[p]autoroomset permissions` za više informacija.

source: Check that the bot has all needed permissions.
hr_hr: Provjeri ima li bot sve potrebne dozvole.

source: You don't have any AutoRoom Sources set up! Set one up with `[p]autoroomset create` first, then I can check what permissions I need for it.
hr_hr: Nemate postavljenih AutoRoom izvora! Prvo postavite jedan pomoću `[p]autoroomset create`, a zatim mogu provjeriti koje mi dozvole trebaju.

source: Since you have multiple AutoRoom Sources, I need the "Add Reactions" permission to display permission information.
hr_hr: Budući da imate više AutoRoom izvora, trebam "Dodavanje reakcija" dozvolu za prikaz informacija o dozvolama.

source: It looks like I am missing one or more required permissions. Until I have them, the AutoRoom Source(s) in question will not function properly. The easiest way of fixing this is just giving me these permissions as part of my server role, otherwise you will need to give me these permissions on the AutoRoom Source and destination category, as specified below.
hr_hr: Čini se da mi nedostaje jedna ili više potrebnih dozvola. Dok ih ne dobijem, dotični AutoRoom izvor(i) neće ispravno funkcionirati. Najlakši način da to popravite je da mi samo date ove dozvole kao dio moje uloge servera, inače ćete mi morati dati te dozvole na AutoRoom izvoru i odredišnoj kategoriji, kao što je navedeno u nastavku.

source: It looks like I am missing one or more optional permissions. All AutoRooms will work, however some features (text channels and cloned source permissions) may not work. The easiest way of fixing this is just giving me these permissions as part of my server role, otherwise you will need to give me these permissions on the destination category, as specified below. In the case of optional permissions, any permission on the AutoRoom Source will be copied to the created AutoRoom, as if we were cloning the AutoRoom Source. In order for this to work, I need each permission to be allowed in the destination category (or server). If it isn't allowed, I will skip copying that permission over.
hr_hr: Čini se da mi nedostaje jedna ili više neobavezna dozvola. Svi AutoRoomi će raditi, no neke značajke (tekstualni kanali i klonirane dozvole izvora) možda neće raditi. Najlakši način da to popravite je da mi samo date ove dozvole kao dio moje uloge servera, inače ćete mi morati dati te dozvole na odredišnoj kategoriji, kao što je navedeno u nastavku. U slučaju neobaveznih dozvola, bilo koja dozvola na AutoRoom izvoru će biti kopirana u kreirani AutoRoom, kao da kloniramo AutoRoom izvor. Da bi ovo funkcioniralo, trebam da mi svaka dozvola bude dopuštena u odredišnoj kategoriji (ili serveru). Ako mi nije dopušteno, preskočit ću kopiranje te dozvole.

source: Everything looks good here!
hr_hr: Sve izgleda dobro!

source: Control access to all AutoRooms.
hr_hr: Kontroliraj pristup svim AutoRoomima.

source: Change Admin access to AutoRooms.
hr_hr: Promijeni administratorski pristup AutoRoomima.

source: Allow Admins to join locked/private AutoRooms.
hr_hr: Dopusti administratorima da se pridruže zaključanim/privatnim AutoRoomima.

source: Admins are {now_or_no_longer} able to join (new) locked/private AutoRooms.
hr_hr: Administratori se {now_or_no_longer} mogu pridružiti (novim) zaključanim/privatnim AutoRoomima.

source: now
hr_hr: sada

source: no longer
hr_hr: više ne

source: Allow Admins to see all AutoRoom Text Channels.
hr_hr: Dopusti administratorima da vide sve AutoRoom teksutalne kanale.

source: Admins are {now_or_no_longer} able to see all (new) AutoRoom Text Channels.
hr_hr: Administratori {now_or_no_longer} mogu vidjeti sve (nove) AutoRoom tekstualne kanale.

source: Change Moderator access to AutoRooms.
hr_hr: Promijeni moderatorski pristup AutoRoomima.

source: Allow Moderators to join locked/private AutoRooms.
hr_hr: Dopusti moderatorima da se pridruže zaključanim/privatnim AutoRoomima.

source: Moderators are {now_or_no_longer} able to join (new) locked/private AutoRooms.
hr_hr: Moderatori se {now_or_no_longer} mogu pridružiti (novim) zaključanim/privatnim AutoRoomima.

source: Allow Moderators to see all AutoRoom Text Channels.
hr_hr: Dopusti moderatorima da vide sve AutoRoom teksutalne kanale.

source: Moderators are {now_or_no_longer} able to see all (new) AutoRoom Text Channels.
hr_hr: Moderatori {now_or_no_longer} mogu vidjeti sve (nove) AutoRoom tekstualne kanale.

source: Create an AutoRoom Source. Anyone joining an AutoRoom Source will automatically have a new voice channel (AutoRoom) created in the destination category, and then be moved into it.
hr_hr: Izradi AutoRoom izvor. Svatko tko se pridruži AutoRoom izvoru automatski će imati novi glasovni kanal (AutoRoom) kreiran u odredišnoj kategoriji, a zatim će biti premješten u njega.

source: Settings saved successfully! Check out `[p]autoroomset modify` for even more AutoRoom Source settings, or to make modifications to your above answers.
hr_hr: Postavke su uspješno spremljene! Pogledaj `[p]autoroomset modify` za još više AutoRoom postavki ili za izmjene vaših gornjih odgovora.

source: Remove an AutoRoom Source.
hr_hr: Ukloni AutoRoom izvor.

source: **{source_channel}** is no longer an AutoRoom Source channel.
hr_hr: **{source_channel}** više nije AutoRoom izvorni kanal.

source: Modify an existing AutoRoom Source.
hr_hr: Izmijeni postojeći AutoRoom izvor.

source: Set the category that AutoRooms will be created in.
hr_hr: Postavi kategoriju u kojoj će se kreirati AutoRoomi.

source: **{autoroom_source}** will now create new AutoRooms in the **{dest_category}** category.
hr_hr: **{autoroom_source}** sada će kreirati nove AutoRoome u **{dest_category}** kategoriji.

source: {message} Do note, this new category does not have sufficient permissions for me to make AutoRooms. Until you fix this, the AutoRoom Source will not work. {details}
hr_hr: {message} Imaj na umu da ova nova kategorija nema pravilne dozvole za izradu AutoRooma. Dok to ne popravite, AutoRoom izvor neće raditi. {details}

source: **{autoroom_source}** is not an AutoRoom Source channel.
hr_hr: **{autoroom_source}** nije AutoRoom izvorni kanal.

source: Choose what type of AutoRoom is created.
hr_hr: Odaberi koja će se vrsta AutoRooma kreirati.

source: Rooms will be open to all. AutoRoom Owner has control over room.
hr_hr: Soba će biti otvorena svima. AutoRoom vlasnik ima kontrolu nad sobom.

source: Rooms will be visible to all, but not joinable. AutoRoom Owner can allow users in.
hr_hr: Sobe će biti vidljive svima, ali se u njih neće moći ulaziti. AutoRoom vlasnik može dopustiti korisnicima ulazak.

source: Rooms will be hidden. AutoRoom Owner can allow users in.
hr_hr: Sobe će biti skrivene. AutoRoom vlasnik može dopustiti korisnicima ulazak.

source: Rooms will be open to all, but the server owns the AutoRoom (so they can't be modified).
hr_hr: Sobe će biti otvorene za sve, ali ih server posjeduje (tako da se ne mogu mijenjati)

source: **{source_channel}** will now create `{room_type}` AutoRooms.
hr_hr: **{source_channel}** će sada stvarati `{room_type}` AutoRoome.

source: **{source_channel}** is not an AutoRoom Source channel.
hr_hr: **{source_channel}** nije AutoRoom izvorni kanal.

source: Set the default name format of an AutoRoom.
hr_hr: Postavi zadani format imena za AutoRoom.

source: Default format: PhasecoreX's Room. Custom format example: `{{username}}'s Room{% if dupenum > 1 %} ({{dupenum}}){% endif %}`
hr_hr: Zadani format: PhasecoreX's Room. Primjer prilagođenog formata: `{{username}}'s Room{% if dupenum > 1 %} ({{dupenum}}){% endif %}`

source: The users current playing game, otherwise the username format. Custom format example: `{{game}}{% if not game %}{{username}}'s Room{% endif %}{% if dupenum > 1 %} ({{dupenum}}){% endif %}`
hr_hr: Korisnikova trenutna igra, inače format korisničkog imena. Custom format example: `{{game}}{% if not game %}{{username}}'s Room{% endif %}{% if dupenum > 1 %} ({{dupenum}}){% endif %}`

source: Hmm... that doesn't seem to be a valid template: `{runtime_error}` If you need some help, take a look at [the readme](https://github.com/PhasecoreX/PCXCogs/tree/master/autoroom/README.md).
hr_hr: Hmm... čini se da to nije valjani predložak: `{runtime_error}` Ako trebate pomoć, pogledajte [readme](https://github.com/PhasecoreX/PCXCogs/tree/master/autoroom/README.md).

source: New AutoRooms created by **{source_channel}** will use the **{room_type}** format
hr_hr: Novi AutoRoomi koje je izradio **{source_channel}** će koristiti **{room_type}** format

source: Example Game
hr_hr: Primjer igre

source: Example room names:
hr_hr: Primjeri naziva soba:

source: Manage if a text channel should be created as well.
hr_hr: Upravljaj treba li stvoriti i tekstualni kanal.

source: Enable creating a text channel with the AutoRoom.
hr_hr: Omogući stvaranje tekstualnog kanal s AutoRoomom.

source: New AutoRooms created by **{source_channel}** will now get their own text channel.
hr_hr: Novi AutoRoomi koje je izradio **{source_channel}** imati će vlastiti tekstualni kanal.

source: Disable creating a text channel with the AutoRoom.
hr_hr: Onemogući stvaranje tekstualnog kanala s AutoRoomom.

source: New AutoRooms created by **{source_channel}** will no longer get their own text channel.
hr_hr: Novi AutoRoomi koje je izradio **{source_channel}** više neće imati vlastiti tekstualni kanal.

source: Configure sending an introductory message to the text channel.
hr_hr: Konfiguriraj slanje uvodne poruke u tekstualni kanal.

source: Send a message to the newly generated text channel. This can have template variables and statements, which you can learn more about by looking at `[p]autoroomset modify name custom`, or by looking at [the readme](https://github.com/PhasecoreX/PCXCogs/tree/master/autoroom/README.md).
hr_hr: Pošalji poruku u novogenerirani tekstualni kanal. Može sadržavati varijable i izjave, o kojima možete saznati više gledajući `[p]autoroomset modify name custom`, ili gledajući [readme](https://github.com/PhasecoreX/PCXCogs/tree/master/autoroom/README.md).

source: New AutoRooms created by **{source_channel}** will have the following message sent to their text channel: {message}
hr_hr: Novi AutoRoomi koje je izradio **{source_channel}** imat će sljedeću poruku poslanu u tekstualni kanal: {message}

source: Disable sending a message to the newly generated text channel.
hr_hr: Onemogući slanje poruke u novogenerirani tekstualni kanal.

source: New AutoRooms created by **{source_channel}** will no longer have a message sent to their text channel.
hr_hr: Novi AutoRoomi koje je izradio **{source_channel}** više neće imati poruku u tekstualnom kanalu.

source: Learn how AutoRoom defaults are set.
hr_hr: Saznaj kako se postavljuju zadane postavke AutoRooma.
