Repository: karlsbjorn/PCXCogs
Catalog: autoroom/locales/*.po
Languages: hr_hr

source: **Bitrate/User Limit** Default bitrate and user limit settings are copied from the AutoRoom Source to the resulting AutoRoom. **Member Roles** Only members that can view and join an AutoRoom Source will be able to join its resulting AutoRooms. If you would like to limit AutoRooms to only allow certain members, simply deny the everyone role from viewing/connecting to the AutoRoom Source and allow your member roles to view/connect to it. **Permissions** All permission overwrites (except for Manage Roles) will be copied from the AutoRoom Source to the resulting AutoRoom. Every permission overwrite you want copied over, regardless if it is allowed or denied, must be allowed for the bot. It can either be allowed for the bot in the destination category or server-wide with the roles it has. `[p]autoroomset permissions` will show what permissions will be copied over.
hr_hr: **Brzina prijenosa/korisničko ograničenje** Zadane postavke brzine prijenosa i korisničkog ograničenja kopiraju se iz AutoRoom izvora u rezultirajući AutoRoom. **Uloge članova** Samo članovi koji mogu vidjeti i pridružiti se AutoRoom izvoru moći će se pridružiti njegovim rezultirajućim AutoRoomima. Ako želite ograničiti AutoRoome tako da dopušta samo određene članove, jednostavno zabranite everyone ulozi da vidi/povezuje se na AutoRoom izvor i dopustite ulogama članova da vide/povezuju se na njega. **Dozvole** Sva prepisivanja dozvola (osim za Upravljanje ulogama) bit će kopirana iz AutoRoom izvora u rezultirajući AutoRoom. Savko prepisivanje dozvola koje želite, bez obzira je li dopušteno ili odbijeno, mora biti dopušteno za bota. Može biti dopušteno za bota u odredišnoj kategoriji ili u cijelom serveru s ulogama koje ima. `[p]autoroomset permissions` će prikazati koje dozvole će se kopirati.
